avr-rust/avrd/packs/xmegad/ATxmega16D4.atdf
        <register caption="Wafer Coordinate X Byte 1" name="COORDX1" offset="0x13" size="1"/>
        <register caption="Wafer Coordinate Y Byte 0" name="COORDY0" offset="0x14" size="1"/>
        <register caption="Wafer Coordinate Y Byte 1" name="COORDY1" offset="0x15" size="1"/>
        <register caption="ADCA Calibration Byte 0" name="ADCACAL0" offset="0x20" size="1"/>
        <register caption="ADCA Calibration Byte 1" name="ADCACAL1" offset="0x21" size="1"/>
        <register caption="ADCB Calibration Byte 0" name="ADCBCAL0" offset="0x24" size="1"/>
        <register caption="ADCB Calibration Byte 1" name="ADCBCAL1" offset="0x25" size="1"/>
        <register caption="Temperature Sensor Calibration Byte 0" name="TEMPSENSE0" offset="0x2E" size="1"/>
        <register caption="Temperature Sensor Calibration Byte 0" name="TEMPSENSE1" offset="0x2F" size="1"/>
      </register-group>
      <value-group caption="NVM Command" name="NVM_CMD">
        <value caption="Noop/Ordinary LPM" name="NO_OPERATION" value="0x00"/>
        <value caption="Read calibration row" name="READ_CALIB_ROW" value="0x02"/>
        <value caption="Read user signature row" name="READ_USER_SIG_ROW" value="0x01"/>
        <value caption="Read EEPROM" name="READ_EEPROM" value="0x06"/>
        <value caption="Read fuse byte" name="READ_FUSES" value="0x07"/>
        <value caption="Write lock bits" name="WRITE_LOCK_BITS" value="0x08"/>
        <value caption="Erase user signature row" name="ERASE_USER_SIG_ROW" value="0x18"/>
        <value caption="Write user signature row" name="WRITE_USER_SIG_ROW" value="0x1A"/>
        <value caption="Erase Application Section" name="ERASE_APP" value="0x20"/>
        <value caption="Erase Application Section page" name="ERASE_APP_PAGE" value="0x22"/>
        <value caption="Load Flash page buffer" name="LOAD_FLASH_BUFFER" value="0x23"/>
        <value caption="Write Application Section page" name="WRITE_APP_PAGE" value="0x24"/>
        <value caption="Erase-and-write Application Section page" name="ERASE_WRITE_APP_PAGE" value="0x25"/>
        <value caption="Erase/flush Flash page buffer" name="ERASE_FLASH_BUFFER" value="0x26"/>
        <value caption="Erase Boot Section page" name="ERASE_BOOT_PAGE" value="0x2A"/>
        <value caption="Erase Flash page" name="ERASE_FLASH_PAGE" value="0x2B"/>
        <value caption="Write Boot Section page" name="WRITE_BOOT_PAGE" value="0x2C"/>
        <value caption="Erase-and-write Boot Section page" name="ERASE_WRITE_BOOT_PAGE" value="0x2D"/>
        <value caption="Write Flash page" name="WRITE_FLASH_PAGE" value="0x2E"/>
        <value caption="Erase and Write Flash page" name="ERASE_WRITE_FLASH_PAGE" value="0x2F"/>
        <value caption="Erase EEPROM" name="ERASE_EEPROM" value="0x30"/>
        <value caption="Erase EEPROM page" name="ERASE_EEPROM_PAGE" value="0x32"/>
        <value caption="Load EEPROM page buffer" name="LOAD_EEPROM_BUFFER" value="0x33"/>
        <value caption="Write EEPROM page" name="WRITE_EEPROM_PAGE" value="0x34"/>
        <value caption="Erase-and-write EEPROM page" name="ERASE_WRITE_EEPROM_PAGE" value="0x35"/>
        <value caption="Erase/flush EEPROM page buffer" name="ERASE_EEPROM_BUFFER" value="0x36"/>
        <value caption="Generate Application section CRC" name="APP_CRC" value="0x38"/>
        <value caption="Generate Boot Section CRC" name="BOOT_CRC" value="0x39"/>
        <value caption="Generate Flash Range CRC" name="FLASH_RANGE_CRC" value="0x3A"/>
      </value-group>
      <value-group caption="SPM ready interrupt level" name="NVM_SPMLVL">
        <value caption="Interrupt disabled" name="OFF" value="0x00"/>
        <value caption="Low level" name="LO" value="0x01"/>
        <value caption="Medium level" name="MED" value="0x02"/>
        <value caption="High level" name="HI" value="0x03"/>
      </value-group>
      <value-group caption="EEPROM ready interrupt level" name="NVM_EELVL">
        <value caption="Interrupt disabled" name="OFF" value="0x00"/>
        <value caption="Low level" name="LO" value="0x01"/>
        <value caption="Medium level" name="MED" value="0x02"/>
        <value caption="High level" name="HI" value="0x03"/>
      </value-group>
      <value-group caption="Boot lock bits - boot setcion" name="NVM_BLBB">
        <value caption="No locks" name="NOLOCK" value="0x03"/>
        <value caption="Write not allowed" name="WLOCK" value="0x02"/>
        <value caption="Read not allowed" name="RLOCK" value="0x01"/>
        <value caption="Read and write not allowed" name="RWLOCK" value="0x00"/>
      </value-group>
      <value-group caption="Boot lock bits - application section" name="NVM_BLBA">
        <value caption="No locks" name="NOLOCK" value="0x03"/>
        <value caption="Write not allowed" name="WLOCK" value="0x02"/>
        <value caption="Read not allowed" name="RLOCK" value="0x01"/>
        <value caption="Read and write not allowed" name="RWLOCK" value="0x00"/>
      </value-group>
      <value-group caption="Boot lock bits - application table section" name="NVM_BLBAT">
        <value caption="No locks" name="NOLOCK" value="0x03"/>
        <value caption="Write not allowed" name="WLOCK" value="0x02"/>
        <value caption="Read not allowed" name="RLOCK" value="0x01"/>
        <value caption="Read and write not allowed" name="RWLOCK" value="0x00"/>
      </value-group>
      <value-group caption="Lock bits" name="NVM_LB">
        <value caption="No locks" name="NOLOCK" value="0x03"/>
        <value caption="Write not allowed" name="WLOCK" value="0x02"/>
        <value caption="Read and write not allowed" name="RWLOCK" value="0x00"/>
      </value-group>
      <value-group caption="Boot Loader Section Reset Vector" name="BOOTRST">
        <value caption="Boot Loader Reset" name="BOOTLDR" value="0x00"/>
        <value caption="Application Reset" name="APPLICATION" value="0x01"/>
      </value-group>
      <value-group caption="32.768kHz Timer Oscillator Pin Selection" name="TOSCSEL">
        <value caption="TOSC1/2 on separate pins" name="ALTERNATE" value="0x00"/>
        <value caption="TOSC1/2 shared with XTAL" name="XTAL" value="0x01"/>
      </value-group>
      <value-group caption="BOD operation" name="BOD">
        <value caption="BOD enabled in sampled mode" name="INSAMPLEDMODE" value="0x01"/>
        <value caption="BOD enabled continuously" name="CONTINOUSLY" value="0x02"/>
        <value caption="BOD Disabled" name="DISABLED" value="0x03"/>
      </value-group>
      <value-group caption="Watchdog (Window) Timeout Period" name="WD">
        <value caption="8 cycles (8ms @ 3.3V)" name="8CLK" value="0x00"/>
        <value caption="16 cycles (16ms @ 3.3V)" name="16CLK" value="0x01"/>
        <value caption="32 cycles (32ms @ 3.3V)" name="32CLK" value="0x02"/>
        <value caption="64 cycles (64ms @ 3.3V)" name="64CLK" value="0x03"/>
        <value caption="128 cycles (0.125s @ 3.3V)" name="128CLK" value="0x04"/>
        <value caption="256 cycles (0.25s @ 3.3V)" name="256CLK" value="0x05"/>
        <value caption="512 cycles (0.5s @ 3.3V)" name="512CLK" value="0x06"/>
        <value caption="1K cycles (1s @ 3.3V)" name="1KCLK" value="0x07"/>
        <value caption="2K cycles (2s @ 3.3V)" name="2KCLK" value="0x08"/>
        <value caption="4K cycles (4s @ 3.3V)" name="4KCLK" value="0x09"/>
        <value caption="8K cycles (8s @ 3.3V)" name="8KCLK" value="0x0A"/>
      </value-group>
      <value-group caption="Start-up Time" name="SUT">
        <value caption="0 ms" name="0MS" value="0x03"/>
        <value caption="4 ms" name="4MS" value="0x01"/>
        <value caption="64 ms" name="64MS" value="0x00"/>
      </value-group>
